In [1]:
import pandas as pd
from pandas import Series

In [2]:
pd.Series([100,200,300])

0    100
1    200
2    300
dtype: int64

In [3]:
pd.Series(index=['철수','영희','아름'], data= [100,200,300])

철수    100
영희    200
아름    300
dtype: int64

In [4]:
pd.Series(index=['삼성전자','셀트리온','카카오','삼성전자우','현대바이오'], data= [	73000,
	356000,
	367000,
	68600,
	34150])

삼성전자      73000
셀트리온     356000
카카오      367000
삼성전자우     68600
현대바이오     34150
dtype: int64

In [5]:
data = [100, 200, 300]
index = ["철수", "영희", "아름"]
s = Series(data, index)
s.index

Index(['철수', '영희', '아름'], dtype='object')

In [6]:
s.values

array([100, 200, 300])

In [7]:
s.to_dict()

{'철수': 100, '영희': 200, '아름': 300}

In [8]:
s.to_excel('data.xlsx')

In [9]:
pd.read_excel('data.xlsx')

  Unnamed: 0    0
0         철수  100
1         영희  200
2         아름  300

In [10]:
s.dtype

dtype('int64')

In [11]:
data = [  10,  "가" ]
s = Series( data )
s.dtype

dtype('O')

In [12]:
s.index.dtype

dtype('int64')

In [13]:
data = {
    "2020-12-11": 73400,
    "2020-12-10": 72900,
    "2020-12-09": 73900,
    "2020-12-08": 71700,
    "2020-12-07": 72900
}
s = pd.Series(data)
s.name = '종가'
s.index.name = '날짜'
s

날짜
2020-12-11    73400
2020-12-10    72900
2020-12-09    73900
2020-12-08    71700
2020-12-07    72900
Name: 종가, dtype: int64

In [14]:
import pandas as pd

data = {"apple": 1500, "banana": 3000}
s = pd.Series(data)
s.to_dict()

{'apple': 1500, 'banana': 3000}

In [15]:
data = {"apple": 1500, "banana": 3000}
s = pd.Series(data)
s.index.name = 'icecream'
s

icecream
apple     1500
banana    3000
dtype: int64

In [16]:

s = pd.Series(data=[1, 2, 3])
s.name = "number"
s

0    1
1    2
2    3
Name: number, dtype: int64

In [17]:
import numpy as np
s = pd.Series(data = [1.0,2.0,np.nan]).astype("float")
s

0    1.0
1    2.0
2    NaN
dtype: float64

In [18]:


s = pd.Series([1, 2, 3])
s.to_numpy()

array([1, 2, 3])

In [19]:

print(s.array)

<NumpyExtensionArray>
[1, 2, 3]
Length: 3, dtype: int64